Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །ཅིའི་ཕྱིར་གནས་བརྟན་རབ་འབྱོར་དོན་ཆེན་པོའི་སླད་དུ་ཉེ་བར་གནས་པའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་བཤད་ཟིན་པའི་སྐབས་ཡང་སླར་གླེངས་ཏེ་བསྟན་ཞེ་ན་འཁོར་བསྡུ་བའི་ཕྱིར་འདི་ཉིད་གླེངས་ནས་རྒྱ་ཆེར་སྤྲོ་བར་འདོད་པའི་ཕྱིར་ཡང་བསྟན་ཏེ།
en: Why does Subhūti, with “it is made available to serve a great purpose,” and so on, again introduce an exposition of a part of the text that has already been explained? He says that in order to gather a retinue, and also because, having introduced just that, he wants a greater enthusiasm.

source: སྔར་ནི་སངས་རྒྱས་རྣམས་ཀྱི་སྔོན་གྱི་སྤྱོད་པ་ལ་ཕན་འདོགས་པ་ཡིན་པར་བསྟན་ཏོ། །ད་ནི་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱེད་དོ་ཞེས་བསྟན་པའོ།
en: Earlier it taught that it benefits the practice prior to a buddha; now it is teaching that it does the work of a buddha. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་གཟུགས་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དང་།
en: This deep perfection of wisdom is made available so that you do not hold on to and do not settle down on form.”

source: མངོན་པར་ཞེན་པ་མེད་པར་ཉེ་བར་གནས་པའོ་ཞེས་བྱ་བ་ནི་གང་གི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཐོང་བས་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ལ་སྲེད་པས་ཡོངས་སུ་འཛིན་པ་དང་། ལྟ་བས་མངོན་པར་ཞེན་པ་མི་འབྱུང་བ་དེའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དང་། མངོན་པར་ཞེན་པ་མེད་པར་ཉེ་བར་གནས་པའོ་ཞེས་བྱ་བའི་མིང་དུ་འགྱུར་ཏེ་དོན་ཆེན་པོ་ཉིད་དུ་སྟོན་ཏོ།
en: Because from seeing the perfection of wisdom they do not on account of craving come to “hold on to” and on account of a view “settle down on form” and so on—the dharmas—therefore it is put into words as “this deep perfection of wisdom is made available so you do not hold on to and do not settle down,” which is to say, it teaches that it is for a truly great purpose. “

source: །རབ་འབྱོར་ངས་ཀྱང་ཞེས་བྱ་བ་ནི་བདག་ཉིད་དབང་དུ་གྱུར་པར་གསུངས་པའོ།
en: Subhūti, I too…” He is saying he himself is in full control. “

source: །དད་པས་རྗེས་སུ་འབྲང་བ་དང་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། དགྲ་བཅོམ་པ་དང་རང་སངས་རྒྱས་ཀྱི་བར་གྱི་ཤེས་པ་དང་། སྤྲོས་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའི་བཟོད་པའོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ནི་ཆེ་བར་བསྟན་ཏེ།
en: That knowledge and abandonment of faith-followers, dharma-followers, up to worthy ones, and pratyekabuddhas, is the forbearance of bodhisattvas who have gained forbearance for the nonproduction of all dharmas” teaches that a bodhisattva’s wisdom is greater.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དགྲ་བཅོམ་པའི་ལམ་གྱི་འབྲས་བུའི་ཤེས་པ་རྣམས་དང་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པ་རྣམས་ནི་ས་བརྒྱད་པ་ལ་ཞུགས་པའི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ཙམ་ཉིད་ཀྱིས་མཐར་གཏུགས་པར་འགྱུར་ཏེ།
en: Just by merely having entered into the eighth level and gained the forbearance for dharmas that are not produced, the knowledges and the abandonments of all afflictions that are the result of the path to all śrāvaka and pratyekabuddha worthy ones are completed.

source: དེ་དག་གི་ཤེས་པ་དང་སྤང་བ་ནི་བཟོད་པ་དེ་ལས་ལྷག་པ་མེད་དོ།
en: Their knowledge and abandonment do not exceed that forbearance.

source: །དེ་ཕན་ཆད་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྣམ་པ་ཐམས་ཅད་དུ་ཉོན་མོངས་པ་མེད་པའོ།
en: From here the bodhisattvas are totally without afflictions. Up to here the bodhisattvas described as those “who have gained forbearance for the nonproduction of dharmas” are the ones without afflictions. “

source: །དེ་དག་ཤིན་ཏུ་ཡང་མི་རིང་བ་ཞིག་ཏུ་ཕྱིན་ནས་མི་སྣང་བར་གྱུར་ཏེ་ཞེས་བྱ་བ་ནི་བཤད་པ་འདིས་དེ་དག་གི་བྱ་བ་ཡོངས་སུ་རྫོགས་པར་བསྟན་ཏོ།
en: Before they had gone very far disappeared”— this explanation teaches that their work has been completed.

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་བཤད་པ་འདི་ལ་མོས་པ་ལ་སོགས་པ་ཕུན་སུམ་ཚོགས་པའི་གང་ཟག་རྣམས་གུས་པ་སྐྱེད་པའི་ཕྱིར་དེ་དག་གི་སྐྱེ་བ་ཞུས་པ།
en: Then the elder Subhūti, to engender respect in persons with perfect belief in this explanation and so on, asks about their birth.

source: གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་མ་ཐག་ཏུ་མོས་པར་འགྱུར་བ་དེ་གང་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་པར་གྱུར་པ་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པའོ།
en: It says, “Where did they die, Lord, the bodhisattva great beings who have taken birth here and believe in this deep perfection of wisdom the moment they hear it?” and so on.

source: །འདིར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དཀར་པོའི་ཕྱོགས་སུ་གཏོགས་པ་གསུམ་དང་ནག་པོའི་ཕྱོགས་སུ་གཏོགས་པ་གསུམ་བསྟན་ཏེ་མི་རྣམས་ཉིད་ཀྱི་ནང་ནས་ཤི་འཕོས་ཏེ་མི་རྣམས་ཉིད་ཀྱི་ནང་དུ་སྐྱེས་པ་ནི་དགེ་བ་སྟེ་གཅིག་གོ།
en: Here it also gives an exposition of the three bodhisattvas that make up the bright side and the three that make up the dark side. Those who “have died a human and taken birth as a human” are good.

source: །སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ནས་ཤི་འཕོས་ཏེ་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་པ་ཡང་དགེ་བ་སྟེ་གཉིས་པའོ།
en: The second who, “having died in other buddhafields, take birth” among humans are good.

source: །དགའ་ལྡན་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་པ་ཡང་དགེ་བ་སྟེ་གསུམ་པའོ།
en: The third who “have died among the Tuṣita gods and taken birth here” are also good.

source: །ནག་པོའི་ཕྱོགས་གསུམ་ནི་སྔོན་གྱི་མཐར་མཉན་པ་དང་ཡོངས་སུ་དྲིས་པ་དང་མི་ལྡན་པས་འདིར་སྐྱེས་ན་ཡང་བཤད་པ་ལ་མ་མོས་པ་ནི་གཅིག་གོ། །སྔོན་གྱི་མཐར་མཉན་པ་ལ་སོགས་པ་དང་མི་ལྡན་པ་འདིར་དད་པ་ཙམ་གྱིས་ཐོས་ན་ཡང་འཕྲོགས་པར་འགྱུར་ཞིང་ལྡམ་ལྡེམ་དུ་འགྱུར་བ་ནི་གཉིས་པའོ། །གང་སྔོན་གྱི་མཐར་བཤད་པ་འདི་དད་པ་ཙམ་གྱིས་དྲིས་ན་ཡང་འཛིན་པ་ལ་སོགས་པ་དང་མི་ལྡན་ན་ཕྱིས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དག་ཏུ་ལྷུང་བར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་གསུམ་པའོ།
en: As for the three on the dark side, there are those who are not endowed with having “heard or asked about it in the past [and] have taken birth here,” but do not believe in the explanation; the second, who are also not endowed with having heard and so on, hear it here just because of faith, but “get robbed” and become uncertain; and the third, who have asked about this explanation in the past just because of faith but still are not endowed with taking it up and so on, and who later fall into “the Śrāvaka and the Pratyekabuddha” Vehicles.

source: །འདིར་ཡང་རྒྱ་མཚོའི་གྲུའི་དཔེ་དང་། བུམ་པའི་དཔེ་དང་། དེ་ནས་ཡང་གྲུའི་དཔེ་དང་མི་རྒད་པོའི་དཔེ་དག་ནི་གཞུང་ཉིད་ལས་བརྡ་ཕྲད་སླའོ།
en: Here the analogy of “the boat on the ocean,” the analogy of “the pot,” and then the analogies of “the ship” and “the very old man” are easy to understand as found in the scripture.

source: །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ཐབས་མཁས་པ་དང་མི་ལྡན་ན་ཐེག་པ་གཉིས་སུ་ལྟུང་གི་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བར་བསྟན་པའི་ཕྱིར་གནས་བརྟན་རབ་འབྱོར་གྱིས་ཇི་ལྟར་དེ་གཉིས་དང་མི་ལྡན་པར་འགྱུར་བ་དང་། ཇི་ལྟར་དེ་གཉིས་དང་མི་ལྡན་པར་མི་འགྱུར་བ་ཞུས་པ་དང་།
en: To teach that when they do not have such a perfection of wisdom and skillful means they fall into the two vehicles, and that when they do have them they reach unsurpassed, complete awakening, Subhūti asks how it is that they do not have those two, and asks how it is that they do not not have those two.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་དམིགས་པའི་དབང་དང་ང་རྒྱལ་གྱི་དབང་གིས་མི་ལྡན་པའི་མིང་དུ་འགྱུར་ཏེ། དེ་ནི་ས་གཉིས་ལས་ས་གང་ཡང་རུང་བ་གཅིག་ཏུ་ལྟུང་བར་འགྱུར་རོ།
en: At that time the Lord puts into words that not having the six perfections is because of the power of apprehending and because of the power of pride, and that they fall to one of the two deficient levels.

source: །གང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་དམིགས་པ་དང་། ང་རྒྱལ་མེད་པ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་བྱེད་དོ་ཞེས་བསྟན་ཏོ།
en: He teaches that those who do not apprehend the six perfections and have no pride “reach unsurpassed, complete awakening.” “

source: །འདི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ནི་ཚུ་རོལ་དུ་ཕྱིན་པའོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཕྱོགས་རྣམ་པར་མི་རྟོག་པ་ལ་ཚུ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: It is because the perfection of giving has gone to the near shore.” The side that is the knowledge of path aspects of bodhisattvas—the absence of conceptualization—is “gone to the near shore.”

source: །སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱོགས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ་རྣམ་པར་མི་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: The side that is the knowledge of all aspects of buddhas is “gone to the farther shore,” because it is the perfection of the absence of conceptualization.

source: །དེ་བས་ན་ཚུ་རོལ་ཡང་ཤེས་ཕ་རོལ་ཡང་ཤེས་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore, it says “knows the near shore and knows the farther shore.”

source: །དེའི་འོག་ཏུ་ཐབས་མཁས་པའི་འགྲེས་ལ་ཡང་རིམ་པ་དེ་ཉིད་དོ།
en: Then the section of the text to do with skillful means is in just that sequence as well.

source: །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཐབས་མཁས་པ་དང་མི་ལྡན་པ་དག་ཐེག་པ་གཉིས་སུ་ལྟུང་བར་འགྱུར་བ་ཐོས་ནས་འོ་ན་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་ལས་དང་པོ་པ་དག་ཇི་ལྟར་འགྱུར་སྙམ་ནས། བཅོམ་ལྡན་འདས་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱི་ཞེས་ཞུས་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་ལས་དང་པོ་པ་དག་ལ་དགེ་བའི་བཤེས་གཉེན་ངེས་པར་དགོས་ཏེ།
en: How those new to the bodhisattva vehicle train Having thus heard that those who do not have the perfection of wisdom and skillful means fall into the two vehicles, thinking, “How, then, do they become those who have newly set out in the vehicle and are beginning the work,” Subhūti asks, “Lord, how should bodhisattva great beings beginning the work train in the perfection of wisdom?”

source: དེ་བས་ན་དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་པར་བྱ་ཞེས་བྱ་བ་བསྟན་ཏོ།
en: And the Lord, because those who are beginning the work definitely have to have spiritual friends, therefore teaches that they “should attend on spiritual friends.” “

source: །མཆོག་ཏུ་འཛིན་པར་མ་བྱེད་ཅིག་ཅེས་བྱ་བ་དང་། འདོད་པ་མ་སྐྱེད་ཅིག་ཅེས་བྱ་བ་ནི་རྣམ་པར་རྟོག་པའི་ལྟ་བ་དང་། དོན་དམ་པ་ལ་ཆགས་པས་སྨོན་པ་མ་བྱེད་ཅིག་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: You should not hold as an absolute,” and “you should not produce a longing for form” means do not, because of conceptual views and attachment to an ultimate, set your hopes on something.

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་དེ་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཚོལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དཀའ་བ་བགྱིད་པའོ་ཞེས་གསོལ་པ་དང་།
en: Nine qualities of the doers of the difficult Then the elder Subhūti said, “Lord, those bodhisattvas who want unsurpassed, perfect, complete awakening, even while all phenomena are empty of their own marks, are doers of the difficult.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྐབས་དེར་འཇིག་རྟེན་ལ་ཕན་པ་དང་། བདེ་བ་དང་མགོན་དང་སྐྱབས་དང་གནས་དང་དཔུང་གཉེན་དང་གླིང་དང་། ཡོངས་སུ་འདྲེན་པ་དང་། རྟེན་དུ་འགྱུར་བར་བྱའོ་ཞེས་བྱ་བ་ཚིག་དགུས་བསྟན་ནས་དེ་ནས་ཡང་ཚིག་དེ་དག་རེ་རེ་ནས་སྨོས་ཏེ། རྒྱ་ཆེར་བཤད་པ་མཛད་དོ། །འགྲོ་བ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ལ།
en: In that context the Lord makes nine statements: “ ‘May I for the world’s benefit and happiness… become the protector… refuge… resting place… final ally… island… leader and… support.

source: འཇིག་པ་མེད་པའི་གནས་སུ་དགོད་པའི་བསམ་པ་ནི་ཕན་པའོ། །སྡུག་བསྔལ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ལ།
en: May I become the benefit and happiness of the world: its protector, refuge, resting place, final ally, island, leader, and support,” which he then explains in detail, discussing each separately. “

source: བདེ་བ་ལ་དགོད་པའི་བསམ་པ་ནི་བདེ་བའོ། །སྡུག་བསྔལ་རྣམས་ལས་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་ཆོས་བཤད་པའི་བསམ་པ་ནི་མགོན་ནོ། །སྡུག་བསྔལ་གྱིས་ཉམ་ཐག་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ལ། ཕུང་པོ་མེད་པའི་མྱ་ངན་ལས་འདས་པར་དགོད་པའི་བསམ་པ་ནི་སྐྱབས་སོ། །ཆགས་པ་མེད་པར་བྱ་བའི་ཕྱིར།
en: The benefit” is the intention to liberate beings from all forms of life and establish them in a place without fear; “the happiness” is the intention to liberate them from suffering and establish them in happiness; “the protector” is the intention to teach the doctrine in order to protect them from suffering; “the refuge” is the intention to liberate those afflicted by suffering from that suffering and establish them in the nirvāṇa without any aggregates remaining; “the resting place” is the intention to explain the doctrine in order that they will have no attachment; “the final ally” is the intention to explain by way of all phenomena, form and so on, the father shore of phenomena; “the island” is the intention to explain the doctrine in a delimited form like an island that is circumscribed; “the leader” is the intention, because of great compassion for beings, to explain the doctrine that leads to nirvāṇa; and “the support” is the intention to understand analytically the places supporting life that are, in brief, eighty-five.

source: ཆོས་འཆད་པའི་བསམ་པ་ནི་གནས་སོ།
en: Those are the successive contents of the passage. “

source: །གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ཀྱིས་ཕ་རོལ་གྱི་ཆོས་འཆད་པའི་བསམ་པ་ནི་དཔུང་གཉེན་ནོ།
en: Lord, how are all phenomena not mingled?”

source: །གླིང་བཞིན་དུ་ཁོ་ར་ཁོར་ཡུག་ཏུ་ཡོངས་སུ་ཆད་པའི་རྣམ་པར་ཆོས་འཆད་པའི་བསམ་པ་ནི་གླིང་ངོ་། །སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོས་མྱ་ངན་ལས་འདས་པར་འདྲེན་པའི་ཆོས་འཆད་པའི་བསམ་པ་ནི་ཡོངས་སུ་འདྲེན་པའོ། །མདོར་ན་འགྲོ་བའི་གནས་བརྒྱད་ཅུ་རྩ་ལྔ་ཉེ་བར་གཟུང་ནས་སོ་སོར་རྟོག་པའི་བསམ་པ་ནི་རྟེན་དུ་འགྱུར་རོ་ཞེས་གཞུང་གི་{གོ་རིམས་སོ,གོ་རིམ་མོ}མོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་འདྲེ་བ་མ་མཆིས་པ་ལགས་ཞེས་བྱ་བ་ནི་འཁོར་བའི་དུས་ན་ཀུན་བརྟགས་པ་དང་། ཡོངས་སུ་གྲུབ་པ་གཉིས་གང་གི་ཚེ་གཅིག་ཏུ་གྱུར་ཏེ་ཐ་དད་པ་མ་ཡིན་པར་གནས་པ་དེའི་ཚེ་དེ་གཉིས་ཐ་དད་པ་མེད་པར་གནས་པ་ནི་འདྲེས་པ་ཞེས་བྱའོ།
en: During saṃsāra, when the falsely imagined and the thoroughly established are as one, are there not broken apart, at that time, when the two are undifferentiable, they are “mingled.”

source: །གང་གི་ཚེ་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་རྒྱུ་མཐུན་པ་ཉན་པ་དང་བསམ་པ་དང་སྒོམ་པ་ལ་སོགས་པའི་མཐུས་རིམ་གྱིས་གནས་གྱུར་པ་ན། ཡོངས་སུ་གྲུབ་པ་དང་ཀུན་བརྟགས་པ་གཉིས་ཐ་དད་པར་གྱུར་ཅིང་ཤིན་ཏུ་རྣམ་པར་དག་པ་དྲི་མ་མེད་པའི་ངོ་བོ་ཉིད་དུ་གནས་པར་གྱུར་པ་དེའི་ཚེ། འདྲེས་པ་མེད་པ་ཞེས་བྱའོ།
en: When there has been a gradual transformation through the force of listening, thinking, and meditating in harmony with the extremely pure dharma-constituent as cause, at that time, when the two—the falsely imagined and the thoroughly established—have become differentiated and a transformation into the extremely pure, stainless, intrinsic nature has come about, they are “not mingled.” “

source: །འབྲེལ་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་ལ་སོགས་པ་ཡང་དེ་ཉིད་ཀྱི་རྣམ་གྲངས་སུ་གཏོགས་པའོ།
en: The nonconnection… the nonproduction… the noncessation,” and so on, are synonymous with just that. “

source: །གཟུགས་ཀྱི་ཕ་རོལ་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་གཟུགས་ཀྱི་མཚན་ཉིད་སྤངས་པའི་ཕྱིར་གཟུགས་ཀྱི་ཕ་རོལ་དུ་གྱུར་པ་ཡིན་ཏེ།
en: The farther shore of form is not form.” This is saying that suchness is the farther shore of form because in it the mark of form has been eliminated.

source: དེ་བས་ན་གཟུགས་ཀྱི་ཕ་རོལ་དུ་གྱུར་པ་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཀུན་བརྟགས་པའི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ་ཞེས་བྱའོ།
en: Therefore, that suchness that serves as the farther shore of form is not the intrinsic nature of falsely imagined form. “

source: །རབ་འབྱོར་གཟུགས་ཇི་ལྟ་བར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ་ཞེས་བྱ་བ་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་དེ་སྐད་གསུངས་ཀྱི།
en: Subhūti, as form really is, so too are all dharmas.” It says this because all phenomena have suchness as their intrinsic nature, not because they are connected with it.

source: མངོན་པར་འབྲེལ་བའི་ཕྱིར་ནི་མ་ཡིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ཉིད་དུ་མི་འགྱུར་ལགས་སམ་ཞེས་བྱ་བ་ནི་ཅི་ལས་དགོངས་ཤེ་ན།
en: What is intended by, “Will not bodhisattva great beings have indeed fully awakened to the knowledge of all aspects?”

source: གལ་ཏེ་ཆོས་ཐམས་ཅད་གཟུགས་ཇི་ལྟ་བ་བཞིན་ནོ། །འོ་ན་ནི་གཟུགས་མངོན་པར་རྟོགས་པ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་མངོན་པར་རྟོགས་པར་འགྱུར་ཏེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ་ཞེས་དགོངས་པའོ།
en: It intends to say that if all dharmas are as form really is, well then, with the clear realization of form comes the clear realization of all dharmas and hence the attainment of the knowledge of all aspects. “

source: །བཅོམ་ལྡན་འདས་གཟུགས་ཀྱི་ཕ་རོལ་ན་རྣམ་པར་རྟོག་པ་གང་ཡང་མ་མཆིས་སོ་ཞེས་བྱ་བ་ནི་གལ་ཏེ་གཟུགས་ཀྱི་ཕ་རོལ་དུ་གྱུར་པ་དེ་བཞིན་ཉིད་ལ་གཟུགས་སུ་རྣམ་པར་རྟོག་པར་གྱུར་ན།
en: Lord, on the farther shore of form there is no thought construction whatsoever.”

source: གཟུགས་ཀྱི་ཕ་རོལ་རྟོགས་པས་ཆོས་ཐམས་ཅད་རྟོགས་པར་མི་འགྱུར་གྱི། གཟུགས་རྟོགས་པ་ཙམ་དུ་ཟད་པར་འགྱུར་བ་ཞིག་ན།
en: Were there to be a thought construction of form in the suchness that is the farther shore of form, then, with the realization of the farther shore of form there would not be the realization of all phenomena, there would just be the realization of form alone.

source: འདི་ལྟར་དེ་བཞིན་ཉིད་ཡིན་པས། གཟུགས་ཀྱི་ཕ་རོལ་ལ་གཟུགས་སུ་རྣམ་པར་རྟོག་པ་མེད་དེ། དེའི་ཕྱིར་དེ་ཙམ་ཞིག་རྟོགས་པས་ཆོས་ཐམས་ཅད་རྟོག་པར་འགྲུབ་བོ།
en: But, because it is suchness, there is no thought construction of form on the farther shore of form, hence the realization of just that is established as the realization of all phenomena.

source: །གླིང་ལྟ་བུའི་ཆོས་རྣམས་མཐོང་བའི་ཕྱིར་གླིང་ངོ་།
en: Because phenomena are seen to be like islands, they are “islands.” “

source: །གཟུགས་ནི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པའོ་ཞེས་བྱ་བ་ནི་གཟུགས་ནི་སྔོན་གྱི་མཐར་དོན་དམ་པར་ནམ་ཡང་མ་བྱུང་། ཕྱི་མའི་མཐར་ཡང་དོན་དམ་པར་ནམ་ཡང་འབྱུང་བར་འགྱུར་བ་མ་ཡིན་ཏེ། དུས་ཐམས་ཅད་དུ་མེད་པའི་ཕྱིར་རོ།
en: Form is delimited by a past and a future.” Ultimately form has never arisen in the past and ultimately will never arise in the future because it does not exist during all periods of time. “

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པ་གང་ཡིན་པ་དེ་ནི་ཞི་བའོ།
en: Subhūti, that delimitation of all phenomena by a past and a future… is calm, it is sublime.”

source: །དེ་ནི་གྱ་ནོམ་པའོ་ཞེས་བྱ་བ་ནི་དུས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དོན་དམ་པ་སྟེ་དེ་རིགས་པའོ་ཞེས་སྟོན་ཏོ།
en: This is teaching that the nonapprehension of all phenomena, because of the emptiness of time, is the ultimate, is viable. “

source: །གཟུགས་ནི་ནམ་མཁའི་ཚུལ་ཅན་ནོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པའི་གཟུགས་ནི་ནམ་མཁའ་བཞིན་དུ་གོས་པ་མེད་ཅིང་འགྱུར་བ་མེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Form has space as its way of being.” This means ultimate form, like space, is untainted and unchanging. “

source: །གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ནི་འགྲོ་བ་དང་། འོང་བ་མེད་པའོ་ཞེས་བྱ་བ་ནི་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་རྣམ་པར་རྟོག་པ་དང་བཅས་པའི་ཚེ་ཡང་གར་ཡང་མི་འགྲོའོ། །ཕྱིས་རྣམ་པར་མི་རྟོག་པའི་ཚེ་ཡང་གང་ནས་ཀྱང་མ་འོངས་སོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The emptiness of form does not go and does not come” means the emptiness of form does not go anywhere, even when together with thought construction, and also does not come from anywhere later on when there is no thought construction. “

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་ཀྱི་ཚུལ་ཅན་ཏེ་ཞེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Subhūti, all phenomena have emptiness as their way of being” means they have emptiness as their intrinsic nature. “

source: །དེ་དག་ནི་ཚུལ་དེ་ལས་མི་འདའོ་ཞེས་བྱ་བ་ནི་ཆོས་དེ་དག་ངོ་བོ་ཉིད་དེ་མི་འདོར་ཞེས་བྱ་བའོ།
en: Because they do not pass beyond that way of being” is saying that the intrinsic nature is not removed from those phenomena.

source: །སྐྱེ་བ་མེད་པ་དང་དངོས་པོ་མེད་པའི་ཚུལ་ཅན་ནོ་ཞེས་བྱ་བ་ནི་རྒྱུ་དང་རྐྱེན་གྱི་མཐུས་མ་སྐྱེས་ཤིང་མ་བྱུང་བ་དང་། ངོ་བོ་ཉིད་ཀྱིས་སྐྱེ་བ་མེད་པའི་ཕྱིར་དངོས་པོ་མེད་པའོ།
en: They “have the unborn and unreal as their way of being”— they are not born—have not arisen—through the force of causes and conditions, and are not real things because in their intrinsic nature they are not produced. “

source: །ཆོས་ཐམས་ཅད་ནི་མཐའ་ཡས་པ་ཞེས་བྱ་བ་ནི་འཇིག་པ་མེད་པའི་ཕྱིར་མཐའ་ཡས་པའོ། །ཚད་མེད་པའི་ཕྱིར་ཀུན་དུ་མཐའ་ཡས་པའོ།
en: Subhūti, all phenomena have the limitless”— they are not destroyed so they are “limitless”; they are immeasurable, so they are “boundless.”

source: །ཡང་ན་རྟག་པ་དང་ཆད་པ་མེད་པའི་ཕྱིར་མཐའ་ཡས་པའོ། །ལུས་མེད་པའི་ཕྱིར་ཀུན་དུ་མཐའ་ཡས་པའོ།
en: Alternatively, they are “limitless” because they do not go on and on forever and are not annihilated, and “boundless” because they are not embodied.

source: །དབྲི་བ་དང་བསྣན་པ་མེད་པའི་ཚུལ་ཅན་ཞེས་བྱ་བ་ནི་ཡོད་པ་ལ་སྐུར་པ་མི་འདེབས་པའི་ཕྱིར་དབྲི་བ་མེད་པའོ།
en: They “have the absence of being taken away from and the absence of being added to as their way of being.” “

source: །མེད་པ་ལ་སྒྲོ་མི་འདོགས་པའི་ཕྱིར་བསྣན་པ་མེད་པའོ།
en: The absence of being taken away from” is because there is no over-negation of what exists; “the absence of being added to” is because there is no over-reification of what does not exist.

source: །འོང་བ་དང་འགྲོ་བ་མེད་པ་ཞེས་བྱ་བ་ནི་གང་ནས་ཀྱང་མ་འོངས་པའི་ཕྱིར་འོང་བ་མེད་པའོ།
en: They “have not going and not coming as their way of being.”

source: །གང་དུ་ཡང་མི་འགྲོ་བའི་ཕྱིར་འགྲོ་བ་མེད་པའོ།
en: They are “not coming” because they have not come from anywhere, and they are “not going” because they are not going anywhere.

source: །བླང་བ་དང་དོར་བ་མེད་པའི་ཚུལ་ཅན་ཞེས་བྱ་བ་ནི་ལས་ཀྱི་ཚེ་ནི་བླང་བ་མེད་པའོ།
en: They “have not bringing in and not sending out as their way of being.”

source: །རྣམ་པར་སྨིན་པའི་ཚེ་ནི་དོར་བ་མེད་པའོ།
en: At the time of the action they are “not bringing in,” and at the time of karmic maturation they are not “not sending out.”

source: །ཕྲད་པ་མེད་པ་དང་འབྲལ་བ་མེད་པ་དང་། འདྲེ་བ་མེད་པ་དང་།
en: They “have not joining, not not joining, not mingling, and not not mingling as their way of being.”

source: མི་འདྲེ་བ་མེད་པའི་ཚུལ་ཅན་ཞེས་བྱ་བ་ནི་རྣམ་པར་རྟོག་པའི་ཚེ་ཡང་ཀུན་བརྟགས་པ་དེ་བཞིན་ཉིད་དང་ལྷན་ཅིག་ཕྲད་པ་མེད་ལ། རྣམ་པར་མི་རྟོག་པའི་ཚེ་ཡང་ཕྱིས་འབྲལ་བ་མེད་པའོ།
en: Even when there is thought construction the falsely imagined is not joined together with suchness; and even later when there is no thought construction it is not not joined.

source: །དེ་བཞིན་དུ་འདྲེ་བ་དང་མི་འདྲེ་བ་ཡང་སྦྱར་རོ།
en: You should construe “not mingling and not not mingling” like this as well.

source: །འདོད་ཆགས་བརྩལ་བས་དབེན་པའི་རང་བཞིན་ནོ་ཞེས་བྱ་བ་ནི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་པའི་ཕྱིར། འདོད་ཆགས་ལ་སོགས་པ་བརྩལ་བ་མེད་པ་སྟེ། འདོད་ཆགས་ལ་སོགས་པའི་རྟགས་རྣམས་དང་།
en: Explanation of Chapters 46 to 50 “In their intrinsic nature they are isolated from the elimination of greed,” and so on.

source: འདོད་ཆགས་ལ་སོགས་པ་སྤྱོད་པའི་རྟགས་རྣམས་དང་། འདོད་ཆགས་ལ་སོགས་པའི་རྒྱུ་རྣམས་དང་། འདོད་ཆགས་ལ་སོགས་པའི་དམིགས་པ་རྣམས་དང་། འདོད་ཆགས་དང་འདོད་ཆགས་མེད་པ་ལ་སོགས་པའི་ཆོས་རྣམས་ནི་སེམས་ལས་བྱུང་བ་ཡིན་ཏེ། དེའི་ཕྱིར་གོ་ཆ་དེ་ནི་གཟུགས་དང་འབྲེལ་པ་མ་ཡིན་ཏེ་ཞེས་བྱ་བ་གསུངས་སོ།
en: There is no elimination of greed and so on because they are isolated in their intrinsic nature, hence “the tokens of greed” and so on, the tokens of a course of conduct that is greedy and so on, the causes of greed and so on, the objective supports of greed and so on, and greed and the absence of greed and so on—all these dharmas have come about from mind, so it says “that armor is not spliced with form.”

source: །གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ཤིན་ཏུ་མེད་པའི་ཕྱིར་ཆོས་དེ་རྣམས་མཚན་མར་བཟུང་སྟེ་གོ་ཆ་འདིས་བགོས་པ་ནི་མ་ཡིན་གྱི།
en: This is teaching that because those dharmas, “form” and so on, “absolutely do not exist,” they have not been buckled with this armor, having apprehended the causal signs of those phenomena.

source: མཚན་མ་མེད་པའི་གོ་ཆ་ཡིན་ནོ་ཞེས་བསྟན་པའོ།
en: This is the armor of signlessness. “

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ས་མཚམས་བཅད་དེ་སེམས་ཅན་གྱི་དོན་དུ་གོ་ཆ་བཙལ་བ་མ་ལགས་སོ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་འདི་སྙེད་ཅིག་མྱ་ངན་ལས་འདའ་འོ་ཞེས་བྱ་བར་ཡོངས་སུ་ངེས་པའི་མཚམས་བཅད་པ་གང་ཡང་མེད་དོ།
en: Lord, bodhisattva great beings have not buckled on armor for the sake of only a partial number of beings.” There is no partial number at all they have decided on, thinking, “We will place beings up to this number in nirvāṇa.”

source: །སུས་ཀྱང་བསྒོམ་པར་མི་བགྱིའོ་ཞེས་བྱ་བ་ནི་བྱེད་པ་པོ་མེད་པའི་ཕྱིར་རོ།
en: Cultivation and disintegration “It is not something that somebody has to meditate on,” because there is no agent. “

source: །གང་དུ་བསྒོམ་པར་མི་བགྱི་ཞེས་བྱ་བ་ནི་ཆོས་གང་ལས་བསྒོམ་པར་བྱ་བ་མ་མཐོང་བའི་ཕྱིར་རོ།
en: It is not something that has to be meditated on somewhere,” because an attribute that has to be cultivated is nowhere to be seen. “

source: །ཇི་ལྟར་ཡང་བསྒོམ་པར་མི་བགྱི་ཞེས་བྱ་བ་ནི་བསྒོམ་པའི་ཡིད་ལ་བྱེད་པ་ཡང་མ་མཐོང་བའི་ཕྱིར་རོ།
en: It is not something that has to be meditated on somehow,” because an attention that has to be meditated on is also not to be seen.
